nxp-mcuxpresso/mcux-soc-svd/MIMXRT1064/MIMXRT1064.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>IOMUXC_SNVS</name>
      <description>IOMUXC_SNVS</description>
      <groupName>IOMUXC_SNVS</groupName>
      <prependToName>IOMUXC_SNVS_</prependToName>
      <baseAddress>0x400A8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x24</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SW_MUX_CTL_PAD_WAKEUP</name>
          <description>SW_MUX_CTL_PAD_WAKEUP SW MUX Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO5_IO00 of instance: gpio5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7</name>
                  <description>Select mux mode: ALT7 mux port: NMI of instance: CM7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad WAKEUP</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_PMIC_ON_REQ</name>
          <description>SW_MUX_CTL_PAD_PMIC_ON_REQ SW MUX Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: SNVS_PMIC_ON_REQ of instance: snvs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO5_IO01 of instance: gpio5</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad PMIC_ON_REQ</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_PMIC_STBY_REQ</name>
          <description>SW_MUX_CTL_PAD_PMIC_STBY_REQ SW MUX Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: CCM_PMIC_STBY_REQ of instance: ccm</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO5_IO02 of instance: gpio5</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad PMIC_STBY_REQ</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_PAD_CTL_PAD_TEST_MODE</name>
          <description>SW_PAD_CTL_PAD_TEST_MODE SW PAD Control Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x30A0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRE</name>
              <description>Slew Rate Field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRE_0_Slow_Slew_Rate</name>
                  <description>Slow Slew Rate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRE_1_Fast_Slew_Rate</name>
                  <description>Fast Slew Rate</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSE</name>
              <description>Drive Strength Field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSE_0</name>
                  <description>HI-Z</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_1</name>
                  <description>Dual/Single voltage: 262/260 Ohm @ 1.8V, 247/157 Ohm @ 3.3V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_2</name>
                  <description>Dual/Single voltage: 134/130 Ohm @ 1.8V, 126/78 Ohm @ 3.3V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_3</name>
                  <description>Dual/Single voltage: 88/88 Ohm @ 1.8V, 84/53 Ohm @ 3.3V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_4</name>
                  <description>Dual/Single voltage: 62/65 Ohm @ 1.8V, 57/39 Ohm @ 3.3V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_5</name>
                  <description>Dual/Single voltage: 51/52 Ohm @ 1.8V, 47/32 Ohm @ 3.3V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_6</name>
                  <description>Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_7</name>
                  <description>Dual/Single voltage: 37/37 Ohm @ 1.8V, 34/23 Ohm @ 3.3V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPEED</name>
              <description>Speed Field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Medium</name>
                  <description>100MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ODE</name>
              <description>Open Drain Enable Field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ODE_0_Open_Drain_Disabled</name>
                  <description>Open Drain Disabled (Output is CMOS)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODE_1_Open_Drain_Enabled</name>
                  <description>Open Drain Enabled (Output is Open Drain)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PKE</name>
              <description>Pull / Keep Enable Field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PKE_0_Pull_Keeper_Disabled</name>
                  <description>Pull/Keeper Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKE_1_Pull_Keeper_Enabled</name>
                  <description>Pull/Keeper Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUE</name>
              <description>Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUE_0_Keeper</name>
                  <description>Keep the previous output value when the output driver is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUE_1_Pull</name>
                  <description>Pull-up or pull-down (determined by PUS field).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUS</name>
              <description>Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUS_0_100K_Ohm_Pull_Down</name>
                  <description>100K Ohm Pull Down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUS_1_47K_Ohm_Pull_Up</name>
                  <description>47K Ohm Pull Up</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUS_2_100K_Ohm_Pull_Up</name>
                  <description>100K Ohm Pull Up</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUS_3_22K_Ohm_Pull_Up</name>
                  <description>22K Ohm Pull Up</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYS</name>
              <description>Hyst. Enable Field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HYS_0_Hysteresis_Disabled</name>
                  <description>Hysteresis Disabled (CMOS input)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYS_1_Hysteresis_Enabled</name>
                  <description>Hysteresis Enabled (Schmitt Trigger input)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_PAD_CTL_PAD_POR_B</name>
          <description>SW_PAD_CTL_PAD_POR_B SW PAD Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1B0A0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRE</name>
              <description>Slew Rate Field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRE_0_Slow_Slew_Rate</name>
                  <description>Slow Slew Rate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRE_1_Fast_Slew_Rate</name>
                  <description>Fast Slew Rate</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSE</name>
              <description>Drive Strength Field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSE_0</name>
                  <description>HI-Z</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_1</name>
                  <description>Dual/Single voltage: 262/260 Ohm @ 1.8V, 247/157 Ohm @ 3.3V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_2</name>
                  <description>Dual/Single voltage: 134/130 Ohm @ 1.8V, 126/78 Ohm @ 3.3V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_3</name>
                  <description>Dual/Single voltage: 88/88 Ohm @ 1.8V, 84/53 Ohm @ 3.3V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_4</name>
                  <description>Dual/Single voltage: 62/65 Ohm @ 1.8V, 57/39 Ohm @ 3.3V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_5</name>
                  <description>Dual/Single voltage: 51/52 Ohm @ 1.8V, 47/32 Ohm @ 3.3V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_6</name>
                  <description>Dual/Single voltage: 43/43 Ohm @ 1.8V, 40/26 Ohm @ 3.3V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_7</name>
                  <description>Dual/Single voltage: 37/37 Ohm @ 1.8V, 34/23 Ohm @ 3.3V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPEED</name>
              <description>Speed Field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Medium</name>
                  <description>100MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ODE</name>
              <description>Open Drain Enable Field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ODE_0_Open_Drain_Disabled</name>
                  <description>Open Drain Disabled (Output is CMOS)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODE_1_Open_Drain_Enabled</name>
                  <description>Open Drain Enabled (Output is Open Drain)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PKE</name>
              <description>Pull / Keep Enable Field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PKE_0_Pull_Keeper_Disabled</name>
                  <description>Pull/Keeper Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKE_1_Pull_Keeper_Enabled</name>
                  <description>Pull/Keeper Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUE</name>
              <description>Pull / Keep Select Field Control signal to enable internal pull-up/down resistors or pad keeper functionality.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUE_0_Keeper</name>
                  <description>Keep the previous output value when the output driver is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUE_1_Pull</name>
                  <description>Pull-up or pull-down (determined by PUS field).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUS</name>
              <description>Pull Up / Down Config. Field Controls signals to select pull-up or pull-down internal resistance strength.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUS_0_100K_Ohm_Pull_Down</name>
                  <description>100K Ohm Pull Down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUS_1_47K_Ohm_Pull_Up</name>
                  <description>47K Ohm Pull Up</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUS_2_100K_Ohm_Pull_Up</name>
                  <description>100K Ohm Pull Up</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUS_3_22K_Ohm_Pull_Up</name>
                  <description>22K Ohm Pull Up</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYS</name>
              <description>Hyst. Enable Field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HYS_0_Hysteresis_Disabled</name>
                  <description>Hysteresis Disabled (CMOS input)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYS_1_Hysteresis_Enabled</name>
                  <description>Hysteresis Enabled (Schmitt Trigger input)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
