nxp-mcuxpresso/mcux-soc-svd/MIMXRT1064/MIMXRT1064.xml
        <register>
          <name>GPR12</name>
          <description>GPR12 General Purpose Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLEXIO1_IPG_STOP_MODE</name>
              <description>FlexIO1 stop mode selection. Cannot change when ipg_stop is asserted.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO1_IPG_STOP_MODE_0</name>
                  <description>FlexIO1 is functional in Stop mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO1_IPG_STOP_MODE_1</name>
                  <description>When this bit is equal to 1'b1 and ipg_stop is asserted, FlexIO1 is not functional in Stop mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO1_IPG_DOZE</name>
              <description>FLEXIO1 ipg_doze mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO1_IPG_DOZE_0</name>
                  <description>FLEXIO1 is not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO1_IPG_DOZE_1</name>
                  <description>FLEXIO1 is in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO2_IPG_STOP_MODE</name>
              <description>FlexIO2 stop mode selection. Cannot change when ipg_stop is asserted.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO2_IPG_STOP_MODE_0</name>
                  <description>FlexIO2 is functional in Stop mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO2_IPG_STOP_MODE_1</name>
                  <description>When this bit is equal to 1'b1 and ipg_stop is asserted, FlexIO2 is not functional in Stop mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO2_IPG_DOZE</name>
              <description>FLEXIO2 ipg_doze mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO2_IPG_DOZE_0</name>
                  <description>FLEXIO2 is not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO2_IPG_DOZE_1</name>
                  <description>FLEXIO2 is in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP_IPG_STOP_MODE</name>
              <description>ACMP stop mode selection. Cannot change when ipg_stop is asserted.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP_IPG_STOP_MODE_0</name>
                  <description>ACMP is functional in Stop mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_IPG_STOP_MODE_1</name>
                  <description>When this bit is equal to 1'b1 and ipg_stop is asserted, ACMP is not functional in Stop mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO3_IPG_STOP_MODE</name>
              <description>FlexIO3 stop mode selection. Cannot change when ipg_stop is asserted.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO3_IPG_STOP_MODE_0</name>
                  <description>FlexIO3 is functional in Stop mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO3_IPG_STOP_MODE_1</name>
                  <description>When this bit is equal to 1'b1 and ipg_stop is asserted, FlexIO3 is not functional in Stop mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO3_IPG_DOZE</name>
              <description>FLEXIO3 ipg_doze mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO3_IPG_DOZE_0</name>
                  <description>FLEXIO3 is not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO3_IPG_DOZE_1</name>
                  <description>FLEXIO3 is in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR13</name>
          <description>GPR13 General Purpose Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ARCACHE_USDHC</name>
              <description>uSDHC block cacheable attribute value of AXI read transactions</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARCACHE_USDHC_0</name>
                  <description>Cacheable attribute is off for read transactions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARCACHE_USDHC_1</name>
                  <description>Cacheable attribute is on for read transactions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AWCACHE_USDHC</name>
              <description>uSDHC block cacheable attribute value of AXI write transactions</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AWCACHE_USDHC_0</name>
                  <description>Cacheable attribute is off for write transactions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AWCACHE_USDHC_1</name>
                  <description>Cacheable attribute is on for write transactions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CANFD_STOP_REQ</name>
              <description>CANFD stop request.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CANFD_STOP_REQ_0</name>
                  <description>stop request off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CANFD_STOP_REQ_1</name>
                  <description>stop request on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHE_ENET</name>
              <description>ENET block cacheable attribute value of AXI transactions</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CACHE_ENET_0</name>
                  <description>Cacheable attribute is off for read/write transactions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CACHE_ENET_1</name>
                  <description>Cacheable attribute is on for read/write transactions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHE_USB</name>
              <description>USB block cacheable attribute value of AXI transactions</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CACHE_USB_0</name>
                  <description>Cacheable attribute is off for read/write transactions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CACHE_USB_1</name>
                  <description>Cacheable attribute is on for read/write transactions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CANFD_STOP_ACK</name>
              <description>CANFD stop acknowledge.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CANFD_STOP_ACK_0</name>
                  <description>CANFD stop acknowledge is not asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CANFD_STOP_ACK_1</name>
                  <description>CANFD stop acknowledge is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR14</name>
          <description>GPR14 General Purpose Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACMP1_CMP_IGEN_TRIM_DN</name>
              <description>reduces ACMP1 internal bias current by 30%</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP1_CMP_IGEN_TRIM_DN_0</name>
                  <description>no reduce</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1_CMP_IGEN_TRIM_DN_1</name>
                  <description>reduces</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP2_CMP_IGEN_TRIM_DN</name>
              <description>reduces ACMP2 internal bias current by 30%</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP2_CMP_IGEN_TRIM_DN_0</name>
                  <description>no reduce</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP2_CMP_IGEN_TRIM_DN_1</name>
                  <description>reduces</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP3_CMP_IGEN_TRIM_DN</name>
              <description>reduces ACMP3 internal bias current by 30%</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP3_CMP_IGEN_TRIM_DN_0</name>
                  <description>no reduce</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP3_CMP_IGEN_TRIM_DN_1</name>
                  <description>reduces</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP4_CMP_IGEN_TRIM_DN</name>
              <description>reduces ACMP4 internal bias current by 30%</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP4_CMP_IGEN_TRIM_DN_0</name>
                  <description>no reduce</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP4_CMP_IGEN_TRIM_DN_1</name>
                  <description>reduces</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP1_CMP_IGEN_TRIM_UP</name>
              <description>increases ACMP1 internal bias current by 30%</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP1_CMP_IGEN_TRIM_UP_0</name>
                  <description>no increase</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1_CMP_IGEN_TRIM_UP_1</name>
                  <description>increases</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP2_CMP_IGEN_TRIM_UP</name>
              <description>increases ACMP2 internal bias current by 30%</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP2_CMP_IGEN_TRIM_UP_0</name>
                  <description>no increase</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP2_CMP_IGEN_TRIM_UP_1</name>
                  <description>increases</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP3_CMP_IGEN_TRIM_UP</name>
              <description>increases ACMP3 internal bias current by 30%</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP3_CMP_IGEN_TRIM_UP_0</name>
                  <description>no increase</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP3_CMP_IGEN_TRIM_UP_1</name>
                  <description>increases</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP4_CMP_IGEN_TRIM_UP</name>
              <description>increases ACMP4 internal bias current by 30%</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP4_CMP_IGEN_TRIM_UP_0</name>
                  <description>no increase</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP4_CMP_IGEN_TRIM_UP_1</name>
                  <description>increases</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP1_SAMPLE_SYNC_EN</name>
              <description>ACMP1 sample_lv source select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP1_SAMPLE_SYNC_EN_0</name>
                  <description>select XBAR output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1_SAMPLE_SYNC_EN_1</name>
                  <description>select synced sample_lv</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP2_SAMPLE_SYNC_EN</name>
              <description>ACMP2 sample_lv source select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP2_SAMPLE_SYNC_EN_0</name>
                  <description>select XBAR output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP2_SAMPLE_SYNC_EN_1</name>
                  <description>select synced sample_lv</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP3_SAMPLE_SYNC_EN</name>
              <description>ACMP3 sample_lv source select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP3_SAMPLE_SYNC_EN_0</name>
                  <description>select XBAR output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP3_SAMPLE_SYNC_EN_1</name>
                  <description>select synced sample_lv</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP4_SAMPLE_SYNC_EN</name>
              <description>ACMP4 sample_lv source select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP4_SAMPLE_SYNC_EN_0</name>
                  <description>select XBAR output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP4_SAMPLE_SYNC_EN_1</name>
                  <description>select synced sample_lv</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR15</name>
          <description>GPR15 General Purpose Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPR16</name>
          <description>GPR16 General Purpose Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x200003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLEXRAM_BANK_CFG_SEL</name>
              <description>FlexRAM bank config source select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXRAM_BANK_CFG_SEL_0</name>
                  <description>use fuse value to config</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXRAM_BANK_CFG_SEL_1</name>
                  <description>use FLEXRAM_BANK_CFG to config</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_INIT_VTOR</name>
              <description>Vector table offset register out of reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
