nxp-mcuxpresso/mcux-soc-svd/MIMXRT1064/MIMXRT1064.xml
        <register>
          <name>ID46</name>
          <description>Message Buffer 46 ID Register</description>
          <alternateGroup>MB_GROUP</alternateGroup>
          <addressOffset>0x364</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXT</name>
              <description>Contains extended (LOW word) identifier of message buffer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STD</name>
              <description>Contains standard/extended (HIGH word) identifier of message buffer.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIO</name>
              <description>Local priority. This 3-bit fieldis only used when LPRIO_EN bit is set in MCR and it only makes sense for Tx buffers. These bits are not transmitted. They are appended to the regular ID to define the transmission priority.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB3_64B_WORD1_H</name>
          <description>Message Buffer 3 WORD_64B Register</description>
          <alternateGroup>MB_64B</alternateGroup>
          <addressOffset>0x364</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_7</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_6</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_5</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_4</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB46_8B_ID</name>
          <description>Message Buffer 46 ID Register</description>
          <alternateGroup>MB_8B_GROUP</alternateGroup>
          <addressOffset>0x364</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXT</name>
              <description>Contains extended (LOW word) identifier of message buffer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STD</name>
              <description>Contains standard/extended (HIGH word) identifier of message buffer.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIO</name>
              <description>Local priority. This 3-bit fieldis only used when LPRIO_EN bit is set in MCR and it only makes sense for Tx buffers. These bits are not transmitted. They are appended to the regular ID to define the transmission priority.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB5_32B_WORD5_H</name>
          <description>Message Buffer 5 WORD_32B Register</description>
          <alternateGroup>MB_32B</alternateGroup>
          <addressOffset>0x364</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_23</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_22</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_21</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_20</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB9_16B_WORD1_H</name>
          <description>Message Buffer 9 WORD_16B Register</description>
          <alternateGroup>MB_16B</alternateGroup>
          <addressOffset>0x364</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_7</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_6</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_5</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_4</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB3_64B_WORD2_H</name>
          <description>Message Buffer 3 WORD_64B Register</description>
          <alternateGroup>MB_64B</alternateGroup>
          <addressOffset>0x368</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_11</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_10</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_9</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_8</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB46_8B_WORD0</name>
          <description>Message Buffer 46 WORD_8B Register</description>
          <alternateGroup>MB_8B_GROUP</alternateGroup>
          <addressOffset>0x368</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_3</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_2</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_1</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_0</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB5_32B_WORD6_H</name>
          <description>Message Buffer 5 WORD_32B Register</description>
          <alternateGroup>MB_32B</alternateGroup>
          <addressOffset>0x368</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_27</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_26</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_25</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_24</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB9_16B_WORD2_H</name>
          <description>Message Buffer 9 WORD_16B Register</description>
          <alternateGroup>MB_16B</alternateGroup>
          <addressOffset>0x368</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_11</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_10</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_9</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_8</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WORD046</name>
          <description>Message Buffer 46 WORD0 Register</description>
          <alternateGroup>MB_GROUP</alternateGroup>
          <addressOffset>0x368</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_3</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_2</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_1</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_0</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB3_64B_WORD3_H</name>
          <description>Message Buffer 3 WORD_64B Register</description>
          <alternateGroup>MB_64B</alternateGroup>
          <addressOffset>0x36C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_15</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_14</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_13</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_12</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB46_8B_WORD1</name>
          <description>Message Buffer 46 WORD_8B Register</description>
          <alternateGroup>MB_8B_GROUP</alternateGroup>
          <addressOffset>0x36C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_7</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_6</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_5</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_4</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB5_32B_WORD7_H</name>
          <description>Message Buffer 5 WORD_32B Register</description>
          <alternateGroup>MB_32B</alternateGroup>
          <addressOffset>0x36C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_31</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_30</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_29</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_28</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB9_16B_WORD3_H</name>
          <description>Message Buffer 9 WORD_16B Register</description>
          <alternateGroup>MB_16B</alternateGroup>
          <addressOffset>0x36C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_15</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_14</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_13</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_12</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WORD146</name>
          <description>Message Buffer 46 WORD1 Register</description>
          <alternateGroup>MB_GROUP</alternateGroup>
          <addressOffset>0x36C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_BYTE_7</name>
              <description>Data byte 0 of Rx/Tx frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_6</name>
              <description>Data byte 1 of Rx/Tx frame.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_5</name>
              <description>Data byte 2 of Rx/Tx frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BYTE_4</name>
              <description>Data byte 3 of Rx/Tx frame.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
