nxp-mcuxpresso/mcux-soc-svd/MIMXRT1064/MIMXRT1064.xml
        <register>
          <name>SAI3_IPP_IND_SAI_RXSYNC_SELECT_INPUT</name>
          <description>SAI3_IPP_IND_SAI_RXSYNC_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x77C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_34_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_34 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B1_05_ALT8</name>
                  <description>Selecting Pad: GPIO_SD_B1_05 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI3_IPP_IND_SAI_TXBCLK_SELECT_INPUT</name>
          <description>SAI3_IPP_IND_SAI_TXBCLK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x780</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_38_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_38 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B1_03_ALT8</name>
                  <description>Selecting Pad: GPIO_SD_B1_03 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI3_IPP_IND_SAI_TXSYNC_SELECT_INPUT</name>
          <description>SAI3_IPP_IND_SAI_TXSYNC_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x784</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_39_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_39 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B1_02_ALT8</name>
                  <description>Selecting Pad: GPIO_SD_B1_02 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SEMC_I_IPP_IND_DQS4_SELECT_INPUT</name>
          <description>SEMC_I_IPP_IND_DQS4_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x788</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B0_00_ALT9</name>
                  <description>Selecting Pad: GPIO_SD_B0_00 for Mode: ALT9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_39_ALT9</name>
                  <description>Selecting Pad: GPIO_EMC_39 for Mode: ALT9</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B0_09_ALT9</name>
                  <description>Selecting Pad: GPIO_AD_B0_09 for Mode: ALT9</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_13_ALT8</name>
                  <description>Selecting Pad: GPIO_B1_13 for Mode: ALT8</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CANFD_IPP_IND_CANRX_SELECT_INPUT</name>
          <description>CANFD_IPP_IND_CANRX_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x78C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_37_ALT9</name>
                  <description>Selecting Pad: GPIO_EMC_37 for Mode: ALT9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B0_15_ALT8</name>
                  <description>Selecting Pad: GPIO_AD_B0_15 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B0_11_ALT8</name>
                  <description>Selecting Pad: GPIO_AD_B0_11 for Mode: ALT8</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
