nxp-mcuxpresso/mcux-soc-svd/MIMXRT1064/MIMXRT1064.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>CSI</name>
      <description>CSI</description>
      <groupName>CSI</groupName>
      <prependToName>CSI_</prependToName>
      <baseAddress>0x402BC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x50</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CSI</name>
        <value>43</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <description>CSI Control Register 1</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000800</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIXEL_BIT</name>
              <description>Pixel Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIXEL_BIT_0</name>
                  <description>8-bit data for each pixel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIXEL_BIT_1</name>
                  <description>10-bit data for each pixel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REDGE</name>
              <description>Valid Pixel Clock Edge Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REDGE_0</name>
                  <description>Pixel data is latched at the falling edge of CSI_PIXCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REDGE_1</name>
                  <description>Pixel data is latched at the rising edge of CSI_PIXCLK</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INV_PCLK</name>
              <description>Invert Pixel Clock Input</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INV_PCLK_0</name>
                  <description>CSI_PIXCLK is directly applied to internal circuitry</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_PCLK_1</name>
                  <description>CSI_PIXCLK is inverted before applied to internal circuitry</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INV_DATA</name>
              <description>Invert Data Input. This bit enables or disables internal inverters on the data lines.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INV_DATA_0</name>
                  <description>CSI_D[7:0] data lines are directly applied to internal circuitry</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_DATA_1</name>
                  <description>CSI_D[7:0] data lines are inverted before applied to internal circuitry</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GCLK_MODE</name>
              <description>Gated Clock Mode Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GCLK_MODE_0</name>
                  <description>Non-gated clock mode. All incoming pixel clocks are valid. HSYNC is ignored.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK_MODE_1</name>
                  <description>Gated clock mode. Pixel clock signal is valid only when HSYNC is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR_RXFIFO</name>
              <description>Asynchronous RXFIFO Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLR_STATFIFO</name>
              <description>Asynchronous STATFIFO Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PACK_DIR</name>
              <description>Data Packing Direction</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PACK_DIR_0</name>
                  <description>Pack from LSB first. For image data, 0x11, 0x22, 0x33, 0x44, it will appear as 0x44332211 in RX FIFO. For stat data, 0xAAAA, 0xBBBB, it will appear as 0xBBBBAAAA in STAT FIFO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PACK_DIR_1</name>
                  <description>Pack from MSB first. For image data, 0x11, 0x22, 0x33, 0x44, it will appear as 0x11223344 in RX FIFO. For stat data, 0xAAAA, 0xBBBB, it will appear as 0xAAAABBBB in STAT FIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCC</name>
              <description>FIFO Clear Control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCC_0</name>
                  <description>Asynchronous FIFO clear is selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCC_1</name>
                  <description>Synchronous FIFO clear is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCIR_EN</name>
              <description>BT.656 Interface Enable. This bit selects the type of interface used.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIR_EN_0</name>
                  <description>Traditional interface is selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIR_EN_1</name>
                  <description>BT.656 interface is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSYNC_POL</name>
              <description>HSYNC Polarity Select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSYNC_POL_0</name>
                  <description>HSYNC is active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSYNC_POL_1</name>
                  <description>HSYNC is active high</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOF_INTEN</name>
              <description>Start Of Frame (SOF) Interrupt Enable. This bit enables the SOF interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOF_INTEN_0</name>
                  <description>SOF interrupt disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOF_INTEN_1</name>
                  <description>SOF interrupt enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOF_POL</name>
              <description>SOF Interrupt Polarity. This bit controls the condition that generates an SOF interrupt.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOF_POL_0</name>
                  <description>SOF interrupt is generated on SOF falling edge</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOF_POL_1</name>
                  <description>SOF interrupt is generated on SOF rising edge</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFF_INTEN</name>
              <description>RxFIFO Full Interrupt Enable. This bit enables the RxFIFO full interrupt.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXFF_INTEN_0</name>
                  <description>RxFIFO full interrupt disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFF_INTEN_1</name>
                  <description>RxFIFO full interrupt enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FB1_DMA_DONE_INTEN</name>
              <description>Frame Buffer1 DMA Transfer Done Interrupt Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FB1_DMA_DONE_INTEN_0</name>
                  <description>Frame Buffer1 DMA Transfer Done interrupt disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FB1_DMA_DONE_INTEN_1</name>
                  <description>Frame Buffer1 DMA Transfer Done interrupt enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FB2_DMA_DONE_INTEN</name>
              <description>Frame Buffer2 DMA Transfer Done Interrupt Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FB2_DMA_DONE_INTEN_0</name>
                  <description>Frame Buffer2 DMA Transfer Done interrupt disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FB2_DMA_DONE_INTEN_1</name>
                  <description>Frame Buffer2 DMA Transfer Done interrupt enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATFF_INTEN</name>
              <description>STATFIFO Full Interrupt Enable. This bit enables the STAT FIFO interrupt.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATFF_INTEN_0</name>
                  <description>STATFIFO full interrupt disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATFF_INTEN_1</name>
                  <description>STATFIFO full interrupt enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SFF_DMA_DONE_INTEN</name>
              <description>STATFIFO DMA Transfer Done Interrupt Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SFF_DMA_DONE_INTEN_0</name>
                  <description>STATFIFO DMA Transfer Done interrupt disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFF_DMA_DONE_INTEN_1</name>
                  <description>STATFIFO DMA Transfer Done interrupt enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF_OR_INTEN</name>
              <description>RxFIFO Overrun Interrupt Enable. This bit enables the RX FIFO overrun interrupt.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RF_OR_INTEN_0</name>
                  <description>RxFIFO overrun interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_OR_INTEN_1</name>
                  <description>RxFIFO overrun interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SF_OR_INTEN</name>
              <description>STAT FIFO Overrun Interrupt Enable. This bit enables the STATFIFO overrun interrupt.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SF_OR_INTEN_0</name>
                  <description>STATFIFO overrun interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SF_OR_INTEN_1</name>
                  <description>STATFIFO overrun interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COF_INT_EN</name>
              <description>Change Of Image Field (COF) Interrupt Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COF_INT_EN_0</name>
                  <description>COF interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COF_INT_EN_1</name>
                  <description>COF interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCIR_MODE</name>
              <description>BT</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIR_MODE_0</name>
                  <description>Progressive mode is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIR_MODE_1</name>
                  <description>Interlace mode is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PrP_IF_EN</name>
              <description>CSI-PrP Interface Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PrP_IF_EN_0</name>
                  <description>CSI to PrP bus is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PrP_IF_EN_1</name>
                  <description>CSI to PrP bus is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EOF_INT_EN</name>
              <description>End-of-Frame Interrupt Enable. This bit enables and disables the EOF interrupt.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EOF_INT_EN_0</name>
                  <description>EOF interrupt is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EOF_INT_EN_1</name>
                  <description>EOF interrupt is generated when RX count value is reached.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXT_VSYNC</name>
              <description>External VSYNC Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT_VSYNC_0</name>
                  <description>Internal VSYNC mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_VSYNC_1</name>
                  <description>External VSYNC mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWAP16_EN</name>
              <description>SWAP 16-Bit Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWAP16_EN_0</name>
                  <description>Disable swapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWAP16_EN_1</name>
                  <description>Enable swapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
