nxp-mcuxpresso/mcux-soc-svd/MIMXRT1064/MIMXRT1064.xml
          <register>
            <name>SMINTEN</name>
            <description>Interrupt Enable Register</description>
            <addressOffset>0x26</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CMPIE</name>
                <description>Compare Interrupt Enables</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>The corresponding STS[CMPF] bit will not cause an interrupt request.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>The corresponding STS[CMPF] bit will cause an interrupt request.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CX0IE</name>
                <description>Capture X 0 Interrupt Enable</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Interrupt request disabled for STS[CFX0].</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Interrupt request enabled for STS[CFX0].</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CX1IE</name>
                <description>Capture X 1 Interrupt Enable</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Interrupt request disabled for STS[CFX1].</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Interrupt request enabled for STS[CFX1].</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CB0IE</name>
                <description>Capture B 0 Interrupt Enable</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Interrupt request disabled for STS[CFB0].</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Interrupt request enabled for STS[CFB0].</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CB1IE</name>
                <description>Capture B 1 Interrupt Enable</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Interrupt request disabled for STS[CFB1].</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Interrupt request enabled for STS[CFB1].</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CA0IE</name>
                <description>Capture A 0 Interrupt Enable</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Interrupt request disabled for STS[CFA0].</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Interrupt request enabled for STS[CFA0].</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CA1IE</name>
                <description>Capture A 1 Interrupt Enable</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Interrupt request disabled for STS[CFA1].</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Interrupt request enabled for STS[CFA1].</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RIE</name>
                <description>Reload Interrupt Enable</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>STS[RF] CPU interrupt requests disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>STS[RF] CPU interrupt requests enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REIE</name>
                <description>Reload Error Interrupt Enable</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>STS[REF] CPU interrupt requests disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>STS[REF] CPU interrupt requests enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SMDMAEN</name>
            <description>DMA Enable Register</description>
            <addressOffset>0x28</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CX0DE</name>
                <description>Capture X0 FIFO DMA Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CX1DE</name>
                <description>Capture X1 FIFO DMA Enable</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CB0DE</name>
                <description>Capture B0 FIFO DMA Enable</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CB1DE</name>
                <description>Capture B1 FIFO DMA Enable</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CA0DE</name>
                <description>Capture A0 FIFO DMA Enable</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CA1DE</name>
                <description>Capture A1 FIFO DMA Enable</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CAPTDE</name>
                <description>Capture DMA Enable Source Select</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Read DMA requests disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EXCEEDFIFO</name>
                    <description>Exceeding a FIFO watermark sets the DMA read request. This requires at least one of DMAEN[CA1DE], DMAEN[CA0DE], DMAEN[CB1DE], DMAEN[CB0DE], DMAEN[CX1DE], or DMAEN[CX0DE] to also be set in order to determine to which watermark(s) the DMA request is sensitive.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOCAL_SYNC</name>
                    <description>A local sync (VAL1 matches counter) sets the read DMA request.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOCAL_RELOAD</name>
                    <description>A local reload (STS[RF] being set) sets the read DMA request.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FAND</name>
                <description>FIFO Watermark AND Control</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OR</name>
                    <description>Selected FIFO watermarks are OR'ed together.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AND</name>
                    <description>Selected FIFO watermarks are AND'ed together.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VALDE</name>
                <description>Value Registers DMA Enable</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>DMA write requests disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SMTCTRL</name>
            <description>Output Trigger Control Register</description>
            <addressOffset>0x2A</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>OUT_TRIG_EN</name>
                <description>Output Trigger Enables</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VAL0</name>
                    <description>PWM_OUT_TRIG0 will set when the counter value matches the VAL0 value.</description>
                    <value>#xxxxx1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VAL1</name>
                    <description>PWM_OUT_TRIG1 will set when the counter value matches the VAL1 value.</description>
                    <value>#xxxx1x</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VAL2</name>
                    <description>PWM_OUT_TRIG0 will set when the counter value matches the VAL2 value.</description>
                    <value>#xxx1xx</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VAL3</name>
                    <description>PWM_OUT_TRIG1 will set when the counter value matches the VAL3 value.</description>
                    <value>#xx1xxx</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VAL4</name>
                    <description>PWM_OUT_TRIG0 will set when the counter value matches the VAL4 value.</description>
                    <value>#x1xxxx</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VAL5</name>
                    <description>PWM_OUT_TRIG1 will set when the counter value matches the VAL5 value.</description>
                    <value>#1xxxxx</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRGFRQ</name>
                <description>Trigger frequency</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>EVERYPWM</name>
                    <description>Trigger outputs are generated during every PWM period even if the PWM is not reloaded every period due to CTRL[LDFQ] being non-zero.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FINALPWM</name>
                    <description>Trigger outputs are generated only during the final PWM period prior to a reload opportunity when the PWM is not reloaded every period due to CTRL[LDFQ] being non-zero.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PWBOT1</name>
                <description>Output Trigger 1 Source Select</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PWM_OUT_TRIG1_SIGNAL</name>
                    <description>Route the PWM_OUT_TRIG1 signal to PWM_OUT_TRIG1 port.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWMB_OUTPUT</name>
                    <description>Route the PWMB output to the PWM_OUT_TRIG1 port.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PWAOT0</name>
                <description>Output Trigger 0 Source Select</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PWM_OUT_TRIG0_SIGNAL</name>
                    <description>Route the PWM_OUT_TRIG0 signal to PWM_OUT_TRIG0 port.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWMA_OUTPUT</name>
                    <description>Route the PWMA output to the PWM_OUT_TRIG0 port.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SMDISMAP0</name>
            <description>Fault Disable Mapping Register 0</description>
            <addressOffset>0x2C</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0xFFFF</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DIS0A</name>
                <description>PWM_A Fault Disable Mask 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DIS0B</name>
                <description>PWM_B Fault Disable Mask 0</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DIS0X</name>
                <description>PWM_X Fault Disable Mask 0</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SMDTCNT0</name>
            <description>Deadtime Count Register 0</description>
            <addressOffset>0x30</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x7FF</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DTCNT0</name>
                <description>DTCNT0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SMDTCNT1</name>
            <description>Deadtime Count Register 1</description>
            <addressOffset>0x32</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x7FF</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DTCNT1</name>
                <description>DTCNT1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
